{
  "errors": {
    "email_taken": "This email address is associated with an existing account.",
    "account_not_found": "Your account could not be found. You must first go through our application process.",
    "account_already_exists": "This account already exists",
    "authentication": {
      "failed": "Invalid login credentials, please try again."
    }
  },
  "projects": {
    "signupRequired": "We have introduced logins to our system. Please create a password for your account below."
  },
  "tasks": {
    "stageDescriptions": {
      "client": {
        "nameAndDescriptionRequired": "This task can not be assigned until it has a name and a description.",
        "quoteRequested": "A quote has been requested for this task",
        "quoteProvided": "{{task.application.specialist.firstName}} has provided a quote for this task. If you are happy to proceed you can assign the task to them.",
        "assigned": "This task has been assigned and is waiting for {{task.application.specialist.firstName}} to start it.",
        "working": "{{task.application.specialist.firstName}} is working on this task.",
        "submitted": "{{task.application.specialist.firstName}} has submitted this task for your approval."
      },
      "specialist": {
        "quoteRequested": "The client has requested a quote for this task. You should not start work on this task until it is assigned to you.",
        "quoteProvided": "You have provided a quote for this task. You should not start work on this task until it is assigned to you.",
        "assigned": "{{task.application.project.user.companyName}} has assigned this task to you and is ready for you to begin working on it.",
        "working": "You have marked this task as in progress. Once you have completed the task you can submit it for approval.",
        "submitted": "You have submitted this task for approval.",
        "estimateRequiredToStart": "You must provide a quote for this task before you can start working on it.",
        "dueDateRequiredToStart": "You must provide a due date for this task before you can start working on it."
      }
    }
  }
}